api/app/services/search_service.rb

SELECT "articles".* FROM "articles"
---
  def self.group params
    Article.group(params[:field])